Repository: hanyEthan/Spikes
Catalog: Code/2013-2014/TAMAM/Code/ADS.Tamam/Core/ADS.Tamam.Resources/Culture/ValidationResources.*.resx
Languages: ar_eg

# PersonUsernameUniqueEditMode
source: Username should be unique, Person cannot be edited while his identity is not valid
ar_eg: اسم المستخدم لايمكن ان يتكرر, لا يمكن تعديل بيانات الشخص بينما هويته غير صحيحة

# PolicyFieldDataTypeInvalid
source: Data Type Invalid
ar_eg: النوع غير صالح

# DepartmentDeleteFailed_RelatedScheduledReports
source: This department can not be deleted. It has one or more scheduled reports
ar_eg: لا يمكن حذف هذا القسم. بعض التقارير المجدولة تعتمد عليه

# ExcuseForPersonConflictWithLeave
source: {0} has a leave in this day. It is not supported to have a leave and an excuse in the same day.
ar_eg: {0} لديه اجازة فى نفس اليوم. لا ندعم اجازة و اذن فى نفس اليوم

# ShiftHavePolicies
source: Shift can not be deleted or deactivated because it has been associated with a policy
ar_eg: لا يمكن حذف او تعطيل الوردية لإرتباطها بسياسة
