Repository: hanyEthan/Spikes
Catalog: Code/2013-2014/TAMAM/Code/ADS.Tamam/Core/ADS.Tamam.Resources/Culture/ValidationResources.*.resx
Languages: ar_eg

# ApprovalStepsUnique
source: Approval Steps Sequance should be Unique
ar_eg: تسلسل الموافقات يجب ان لا يتكرر

# ArabicNameEmpty
source: Arabic Name is not provided
ar_eg: لم يتم توفير اسم العربية

# ArabicNameLength
source: Arabic Name Should not Exceed 200
ar_eg: الاسم العربى لا يجب ان يتعدى 200 حرف

# AttendanceCodeIsCodeUnique
source: This Code is already used in another one
ar_eg: هذا الكود مستخدم من قبل

# AttendanceCodeIsEmpty
source: Code cannot be null or empty
ar_eg: برجاء ادخال الكود

# AttendanceDateMissing
source: Invalid Date
ar_eg: التاريخ غير صحيح

# CommentIncorrect
source: Comment length should not exceed 100
ar_eg: التعليق يجب ان لا يتعدي 100 حرف

# CommentMissing
source: Invalid Comment
ar_eg: التعليق غير متاح

# DepartmentDeleteFailed
source: This department can not be deleted. It has other departments or people
ar_eg: لا يمكن حذف هذا القسم. بعض الاقسام او الاشخاص تعتمد عليه

# DepartmentDeleteFailed_RelatedSchedules
source: This department can not be deleted. It has one or more schedules
ar_eg: لا يمكن حذف هذا القسم. بعض الجداول الزمنيه تعتمد عليه

# DepartmentNameCultureVariantEmpty
source: Department Name (Culture Variant) is not provided
ar_eg: برجاء إدخال اسم القسم العربى

# DepartmentParentEqSelf
source: Department Parent Can not be the department itself
ar_eg: القسم التابع له لا يمكن ان يكون القسم نفسه

# DepartmentParentInvalid
source: Parent department is not provided
ar_eg: فقط يسمح بقسم رئيسى واحد

# DepartmentParentRecursive
source: Parent department cant be a child of the same department
ar_eg: القسم التابع له لا يمكن ان يكون من الاقسام الفرعية التابعة له

# DepartmentUsedInPolicy
source: Department Cannot be deleted, It's being used in Department Rule Policy
ar_eg: لا يمكن حذف هذا القسم. لاستعمالها فى سياسات قواعد الاقسام

# DirectManagerSequanceEmpty
source: Direct Manager Sequance is not valid
ar_eg: تسلسل المدير المباشر غير صحيح

# EndTimeEmpty
source: End time is not provided
ar_eg: لم يتم توفير وقت النهاية

# ExcuseCanCancelled
source: Excuse for {0} can not to be cancelled
ar_eg: لا يمكن إلغاء الاذن ل{0}

# ExcuseCanReviewed
source: Excuse for {0} can not be reviewed
ar_eg: لا يمكن مراجعة الاذن

# EditTakenExcuse
source: When editing taken excuse you can only edit it's notes or attachments
ar_eg: عند تعديل اذن ماخوذ يمكنك تغيير الملاحظات او الملحقات فقط

# ExcuseDateEmpty
source: Excuse for {0} Date is not provided
ar_eg: برجاء إدخال تاريخ الاذن ل {0}

# ExcuseDurationForPersonNameEqualZero
source: No shifts for {0} in this time frame
ar_eg: لا يوجد وردية فى هذا الوقت ل{0}

# ExcuseEndTimeEmpty
source: Excuse for {0} End Time is not provided
ar_eg: برجاء إدخال وقت نهاية الاذن ل{0}

# ExcuseInvalidEndTime
source: {0} for {1} End Time must be greater than Start Time
ar_eg: وقت نهاية {0} يجب ان يكون اكبر من بدايته ل {1}

# ExcusePersonEmpty
source: Person name is not provided
ar_eg: اسم الموظف غير متوفر

# ExcuseStartTimeEmpty
source: Excuse for {0} Start Time is not provided
ar_eg: برجاء إدخال وقت بداية الاذن ل{0}

# ExcuseStatusEmpty
source: Excuse for {0} Status is not provided
ar_eg: برجاء اختيار حالة الاذن ل{0}

# ExcuseUnique
source: This {0} for person {1} overlaps with another excuse or away
ar_eg: هذا {0} للموظف {1} يتعارض مع اذن او مهام العمل اخر فى نفس الوقت

# HRRoleEmpty
source: Kindly Enter Valid HR Role
ar_eg: يرجى إدخال صالح الموارد البشرية دور

# HRSequanceEmpty
source: HR Sequance is not valid
ar_eg: تسلسل الموارد البشرية غير صحيح

# InvalidCreateLeaveStatus
source: Leave for {0} status must be Pending or Planned
ar_eg: حالة الاجازة ل{0} يجب ان تكون مخطط لها او تحت الموافقة

# InvalidDatesOrder
source: Dates orders are invalid
ar_eg: ترتيب التواريخ غير صحيح

# InvalidEmail
source: Invalid Email Address Format
ar_eg: بريد الكترونى غير صحيح

# InvalidExcuseCreationDate
source: {0} for {1} date must be in the previous, current or next month
ar_eg: تاريخ {0} يجب ان يكون فى الشهر الماضى او الحالى او القادم ل{1}

# InvalidExcusePolicyAllowedHoursPerDay
source: Allowed hours per day is not valid
ar_eg: عدد الساعات المتاحة فى اليوم غير صحيح

# InvalidExcusePolicyAllowedHoursPerDay_NoCredit
source: For excuse that has no credit Allowed hours per day must be empty or zero
ar_eg: لمهام العمل عدد الساعات المتاحة فى اليوم يجب ان تكون فارغه او صفر

# InvalidExcusePolicyAllowedHoursPerMonth
source: Allowed hours per month is not valid
ar_eg: عدد الساعات المتاحة فى الشهر غير صحيح

# InvalidExcusePolicyAllowedHoursPerMonth_NoCredit
source: For excuse that has no credit Allowed hours per month must be empty or zero
ar_eg: لمهام العمل عدد الساعات المتاحة فى الشهر يجب ان تكون فارغه او صفر

# InvalidExcusePolicyMaxExcusesPerDay
source: Maximum excuses per day is not valid
ar_eg: اعلى عدد استئذانات في اليوم غير صحيح

# InvalidExcusePolicyMaxExcusesPerDay_NoCredit
source: For excuse that has no credit Maximum excuses per day must be empty or zero
ar_eg: لمهام العمل اعلى عدد فى اليوم يجب ان يكون فارغ او صفر

# InvalidExcusePolicyMaxExcusesPerMonth
source: Maximum excuses per month is not valid
ar_eg: اعلى عدد فى الشهر غير صحيح

# InvalidExcusePolicyMaxExcusesPerMonth_NoCredit
source: For excuse that has no credit Maximum excuses per month must be empty or zero
ar_eg: لمهام العمل اعلى عدد فى الشهر يجب ان يكون فارغ او صفر

# InvalidExcusePolicyMinDurationPerExcuse
source: Minimum duration per excuse is not valid
ar_eg: اقل فترة مسموحة للإذن غير صحيحة

# InvalidExcusePolicyMinDurationPerExcuse_NoCredit
source: For excuse that has no credit Minimum duration per excuse must be empty or zero
ar_eg: لمهام العمل اقل فترة مسموحة للإذن يجب ان تكون فارغه او صفر

# InvalidExcuseRequestDate
source: {0} date must be in the remaining days of the current month or in the next month
ar_eg: تاريخ {0} يجب ان يكون فى الايام المتبقية من الشهر الحالى او فى الشهر القادم

# InvalidFaxLength
source: Fax must be at maximum 20 number
ar_eg: الفاكس يجب ان يكون 20 رقم على الاكثر

# InvalidLeavePolicyAmount
source: Allowed Amount is not valid
ar_eg: الحد المسموح غير صحيح

# InvalidLeavePolicyCarryOver
source: Max Carry Over Days is not valid
ar_eg: اعلى قيمة للترحيل غير صحيح

# InvalidLeavePolicyRequest
source: Days Before request is not valid
ar_eg: عدد الايام قبل الطلب غير صحيح

# InvalidPhone
source: Invalid Phone Number
ar_eg: رقم تليفون غير صحيح

# InvalidPhoneLength
source: Phone must be at maximum 20 number
ar_eg: الهاتف يجب ان يكون 20 رقم على الاكثر

# InvalidSchedulePerson
source: Some of the selected persons have a schedule overlapping with this schedule
ar_eg: بعض الأشخاص المختارين متواجدين على جدول زمنى يتعارض مع هذا الجدول الزمنى

# InvalidScheduleDepartment_Overlap
source: There are some overlaps in schedule times for departments
ar_eg: يوجد تداخل في اوقات الجدول الزمنى للاقسام

# InvalidScheduleDepartment_Duplicates
source: There are some duplicates in schedule times for departments
ar_eg: يوجد تكرار في اوقات الجدول الزمنى للاقسام

# InvalidSchedulePersonnel_Overlap
source: There are some overlaps in schedule times for personnel
ar_eg: يوجد تداخل في اوقات الجدول الزمنى للموظفيين

# InvalidSchedulePersonnel_Duplicates
source: There are some duplicates in schedule times for personnel
ar_eg: يوجد تكرار في اوقات الجدول الزمنى للموظفيين

# InvalidScheduleDepartment_OverlapWithOtherSchedules
source: There are some overlaps in schedule times for departments with other schedules
ar_eg: يوجد تداخل في اوقات الجدول الزمنى للاقسام مع جداول زمنيه اخري

# InvalidSchedulePersonnel_OverlapWithOtherSchedules
source: There are some overlaps in schedule times for personnel with other schedules
ar_eg: يوجد تداخل في اوقات الجدول الزمنى للموظفيين مع جداول زمنيه اخري

# InvalidScheduleDepartment_StartDateEndDate
source: End date for departments schedules should be greater than or equal start date
ar_eg: تاريخ نهايه الجدول الزمنى للاقسام يجب ان يكون اكبر من او يساوي تاريخ بدايه الجدول الزمنى

# InvalidSchedulePersonnel_StartDateEndDate
source: End date for personnel schedules should be greater than or equal start date
ar_eg: تاريخ نهايه الجدول الزمنى للموظفيين يجب ان يكون اكبر من او يساوي تاريخ بدايه الجدول الزمنى

# InvalidScheduleDepartment_ScheduleDateRange
source: Schedules dates for departments should be in schedule date range
ar_eg: الجدول الزمنى للاقسام يجب ان يكون في الفتره الزمنيه المحدده للجدول الزمني

# InvalidSchedulePersonnel_ScheduleDateRange
source: Schedules dates for personnel should be in schedule date range
ar_eg: الجدول الزمنى للموظفيين يجب ان يكون في الفتره الزمنيه المحدده للجدول الزمني

# InvalidShiftTimes
source: Shift start or end time is not valid
ar_eg: توقيت بداية الوردية او نهاية الوردية غير صحيح

# LeaveCanCancelled
source: This leave for {0} can not to be cancelled
ar_eg: لا يمكن إلغاء هذه الاجازة ل {0}

# LeaveCanEdit
source: Leave for {0} can not to be edited
ar_eg: لا يمكن تعديل هذه الاجازة ل{0}

# LeaveCanReviewed
source: Leave can not to be reviewed
ar_eg: لا يمكن مراجعة هذه الاجازة

# LeaveEffectiveDaysEqualZero
source: No working days in this time frame for {0}
ar_eg: لا يوجد ايام شغل فى هذه الفترة ل{0}

# LeaveEndDateEmpty
source: Leave End Date for {0} is not provided
ar_eg: برجاء ادخال تاريخ نهاية الاجازة

# LeaveInvalidStartAndEndDate
source: Leave End Date for {0} must be greater than or equal to Leave Start Date
ar_eg: تاريخ نهاية الاجاة ل{0} يجب ان يكون اكبر من او يساوى تاريخ بدايتها

# LeaveOutCredit
source: Leave for {0} is outside current credit year
ar_eg: الاجازة ل{0} خارج نطاق رصيد الاجازات الحالى

# PersonIdEmpty
source: Person name is not provided
ar_eg: اسم الموظف غير متوفر

# DuplicatePersonId
source: There are some duplicates in people data
ar_eg: يوجد بعض التكرار في بينات الموظفين

# LeavePersonNotActive
source: Person {0} is not active
ar_eg: الموظف {0} غير مفعل

# LeaveRequestDaysBefore
source: You need {0} days before leave start date
ar_eg: تحتاج {0} أيام قبل طلب الاجازة

# LeaveRequestNotAllowed
source: You are not allowed to request leave
ar_eg: لا يمكنك طلب أجازة

# LeaveRequestOldDate
source: You can not request leave for old dates
ar_eg: لا يمكن طلب أجازة فى تاريخ قديم

# LeaveStartDateEmpty
source: Leave for {0} Start Date is not provided
ar_eg: برجاء إدخال تاريخ بداية الاجازة ل{0}

# LeaveStartDateInvalid
source: Leave for {0} Start is before Leave credit effective date.
ar_eg: تاريخ بداية الأجازة ل{0} يسبق تاريخ بداية رصيد الاجازات

# EditCanceledLeaveWithUnexpectedValues
source: When editing taken leave you can only edit it's notes or attachments
ar_eg: عند تعديل اجازه ماخوذه يمكنك تغيير الملاحظات او الملحقات فقط

# LeaveStatusIdEmpty
source: Leave Status for {0} is not provided
ar_eg: برجاء إدخال حالة الاجازة ل{0}

# LeaveTypeHasNoCredit
source: No Credit available for this leave type for {0}
ar_eg: لا يوجد رصيد كافى لهذه الاجازة ل {0}

# PersonHasNoPolicyForExcuseType
source: {0} has no policy for this excuse type
ar_eg: {0} لا توجد لديه سياسه لهذا النوع من الاستئذانات

# LeaveTypeIdEmpty
source: Leave Type for {0} is not provided
ar_eg: برجاء إدخال نوع الاجازة ل{0}

# LeaveUnique
source: Leave dates for {0} overlaps with another one
ar_eg: يوجد أجازة فى نفس التاريخ ل{0}

# NameArabicEmpty
source: Name (Arabic) is not provided
ar_eg: الاسم (عربى) غير متوفر

# NameCultureVariantNotUnique
source: Name (Arabic) should be Unique
ar_eg: الاسم (عربى) مستخدم من قبل

# NameEmpty
source: Name is not provided
ar_eg: لم يتم توفير اسم

# NameLength
source: Name Should not Exceed 200
ar_eg: الاسم لا يجب ان يتعدى 200 حرف

# NameNotUnique
source: Name should be Unique
ar_eg: الاسم مستخدم من قبل

# OrganizationDetailCodeEmpty
source: Organization Code is not provided
ar_eg: كود الوزارة غير محدد

# OrganizationDetailNameCultureVariantEmpty
source: Organization Name (Culture Variant) is not provided
ar_eg: اسم الوزارة (عربى) غير محدد

# OrganizationDetailNameEmpty
source: Organization Name is not provided
ar_eg: اسم الوزارة غير محدد

# PersonAddressLength
source: Address length should not exceed 200 characters
ar_eg: العنوان لا يجب ان يتخطى 200 حرف

# PersonBirthDateEmpty
source: Birth Date is not provided
ar_eg: تاريخ الميلاد غير محدد

# PersonBirthDateInvalid
source: Employee age is not valid when joining the company
ar_eg: عمر الموظف غير مناسب عند الالتحاق بالوزارة

# PersonCodeEmpty
source: Person Code is not provided
ar_eg: رقم الموظف غير محدد

# PersonCodeLength
source: Code should be within 1 and 50 letters
ar_eg: الكود يجب ان يكون مابين 1 الى 50 حرف

# PersonCodeUnique
source: Person Code Should be Unique
ar_eg: رقم الموظف لا يمكن ان يتكرر

# PersonEmailUnique
source: Person Email Should be Unique
ar_eg: البريد الالكتروني للموظف لا يمكن ان يتكرر

# IdentifierUnique
source: Code, Email, or Username need to be Unique
ar_eg: الكود, البريد الالكترونى, اسم المستخدم للموظف يجب الا تتكرر

# PersonDepartmentEmpty
source: Person Department is not provided
ar_eg: القسم غير محدد

# PersonEmailLength
source: Email should not exceed 50 characters
ar_eg: البريد الالكترونى لا يمكن ان يتخطى 50 حرف

# PersonFullNameCultureVariantEmpty
source: Full Name (Arabic) is not provided
ar_eg: اسم الموظف (عربى) غير محدد

# PersonFullNameCultureVariantLength
source: Full Name (Arabic) should be within 4 and 100 letters
ar_eg: الاسم (عربى) يجب ان يكون مابين 4 الى 100 حرف

# PersonFullNameEmpty
source: Full Name is not provided
ar_eg: اسم الموظف غير محدد

# PersonFullNameLength
source: Full Name should be within 4 and 100 letters
ar_eg: الاسم يجب ان يكون مابين 4 الى 100 حرف

# PersonInvalidUserId
source: Invalid User Id
ar_eg: المستخدم غير صحيح

# PersonIsManager
source: This Person Cannot be deactivated because someone else is reporting to him
ar_eg: هذا الشخص لا يمكن تعطيله لأن هناك اشخاص اخرون يقدمون تقارير اليه

# PersonJoinDateEmpty
source: Person Join Date is not provided
ar_eg: تاريخ الالتحاق بالعمل غير محدد

# PersonJoinDateGreaterThanBirthDate
source: Join Date is not valid in regards to the Birthdate or the Creation Date
ar_eg: تاريخ الالتحاق غير منسب بالنسبة لتاريخ الميلاد أو بالنسبة لتاريخ التسجيل

# PersonPassportNumberLength
source: Passport number length should not exceed 40 digits
ar_eg: رقم جواز السفر لا يجب ان يتخطى ال 40 رقم

# PersonSSNLength
source: Person Civil No. should be between 6 and 40 characters
ar_eg: الرقم القومى يجب ان يكون ما بين 6 و 40 حرف

# PersonUserIdIsUnique
source: User Id already associated with another Person
ar_eg: هذا المستخدم غير صحيح

# PersonUsernameUnique
source: Username should be unique
ar_eg: اسم المستخدم لايمكن ان يتكرر

# PolicyAssociationsCheck
source: Policy is being associated with Policy Groups
ar_eg: هذه السياسة مرتبطة بمجموعة سياسات

# PolicyCodeEmpty
source: Policy Code is not provided
ar_eg: برجاء إدخال كود السياسة

# PolicyCodeLength
source: Code length is not valid
ar_eg: طول الكود غير صحيح

# PolicyCodeUnique
source: Policy Code Should be Unique
ar_eg: هذا الكود مستخدم من قبل

# PolicyDeleteFail
source: This policy cannot be deleted because some other policy is associated with it
ar_eg: لا يمكن حذف هذه السياسة لأن يرتبط بعض السياسات الاخرى معها

# PolicyFieldDataTypeEmpty
source: Data Type is not provided
ar_eg: لم يتم توفير البيانات التصنيف

# PolicyFieldReferenceIdInvalid
source: Reference Id is not provided
ar_eg: لم يتم توفير مرجع معرف

# PolicyFieldReferenceTypeInvalid
source: Invalid Reference Type. For List Data Type Reference Type can not be empty
ar_eg: غير صالح نوع مرجع. لقائمة نوع البيانات مرجع نوع لا يمكن أن تكون فارغة

# PolicyFieldSequanceInValid
source: Sequence is not valid
ar_eg: تسلسل غير صالح

# PolicyGroupArabicNameEmpty
source: Policy Group Arabic Name is not provided
ar_eg: لم يتم توفير نهج المجموعة اسم العربية

# PolicyGroupHaveAssociations
source: Policy Group can not be Deleted, because it may be associated with personnel or departments or policies
ar_eg: لا يمكن تعطيل هذه المجموعة لأنها مرتبطه بموظفين او اقسام او سياسات

# PolicyGroupNameEmpty
source: Policy Group Name is not provided
ar_eg: لم يتم توفير سياسة اسم المجموعة

# PolicyNameCultureVariantLength
source: Policy Name (Arabic) Should not Exceed 200
ar_eg: إسم السياسة العربى لايمكن ان يتعدى 200

# PolicyNameCultureVariantUnique
source: Policy Name (Arabic) Should be Unique
ar_eg: إسم السياسة العربى مستخدم من قبل

# PolicyNameLength
source: Policy Name Should not Exceed 200
ar_eg: إسم السياسة لايمكن ان يتخطى 200

# PolicyNameUnique
source: Policy Name Should be Unique
ar_eg: إسم السياسة مستخدم من قبل

# PolicyTypeNotValid
source: Policy Type is Not Valid
ar_eg: نوع السياسة غير صحيح

# PolicyValuesCheck
source: Policy Values are not valid
ar_eg: قيم السياسة غير صحيحة

# ScheduleTemplateEmpty
source: Schedule Template is not provided
ar_eg: القالب غير محدد

# ScheduleTemplateMonthRepeat
source: Monthly template can not repeat greater or less than one time
ar_eg: تفاصيل الجدول الزمنى الشهرى لا يمكن ان يتكرر اكثر او اقل من مرة واحدة

# ScheduleTemplateNameNotValid
source: Template Name is not valid
ar_eg: اسم القالب غير صالح

# ScheduleTemplateNoDetails
source: A template must have at least one detail with shift
ar_eg: تفاصيل الجدول الزمنى يجب ان تحتوى على وردية واحد على الاقل

# ScheduleTemplateMoreThanOneFlexible
source: A template must have at most one flexible shift per day
ar_eg: تفاصيل الجدول الزمنى يجب ان لا تحتوي علي اكثر من ورديه في حاله ان احدها ورديه مرنه

# ScheduleTemplatePersonAndDepartmentEmpty
source: Personnel or department should be provided
ar_eg: يجب اختيار الموظفين او الاقسام

# ScheduleTemplateRepeatEmpty
source: Repeat is not provided
ar_eg: يتكرر كل غير متوفر

# ScheduleTemplateRepeatTypeEmpty
source: Repeat Type is not provided
ar_eg: لم يتم توفير تكرار نوع

# ScheduleTemplateWeekRepeat
source: Week Repeat cant exceed 6
ar_eg: الأسبوع كرر غير قادر تتجاوز 6

# SecurityIdLength
source: Security Id Should not Exceed 100
ar_eg: رقم الحضور لا يمكن ان يتخطى 100 رقم او حرف

# ShiftHaveTemplates
source: Shift can not be deleted or deactivated because it has been associated with a schedule template
ar_eg: لا يمكن حذف او تعطيل الوردية لإرتباطها بتفاصيل جدول زمنى

# ShiftInTemplatesOverlap
source: The new shift time Overlap with another shift time associated in the same Schedule Template
ar_eg: أوقات الوردية الجديدة تتعارض مع اوقات الوردية التى معه فى نفس تفاصيل الجدول

# StartDateEmpty
source: Start Date is not provided
ar_eg: لم يتم توفير تاريخ بدء

# StartDateLessEndDate
source: Start Date must be less than or equal to end date
ar_eg: تاريخ بداية الجدول يجب أن يكون أقل أو يساوى تاريخ الانتهاء

# StartTimeEmpty
source: Start time is not provided
ar_eg: لم يتم توفير وقت البدء

# SuperManagerSequanceEmpty
source: Super Manager Sequance is not valid
ar_eg: تسلسل المدير الاعلى غير صحيح

# TemplateHaveSchedule
source: Template can not be deleted or deactivated because it has been associated with a schedule
ar_eg: لا يمكن حذف التفاصيل أو تعطيلها لأنها مرتبطة مع جدول زمنى

# LeaveHalfDayInvalid
source: Half Day Leave for {0} should be applied on only one single day
ar_eg: نصف يوم اجازة يجب ان يطبق على يوم واحد فقط ل{0}

# LeaveHalfDayNotAllowed
source: Can't request half day for this leave type for {0}
ar_eg: لا يمكن طلب اجازة لهذا النوع من الاجازات ا {0}

# EndDateShouldGreaterThanStartDate
source: End Date should be greater than Start Date
ar_eg: تاريخ الانتهاء يجب ان يكون اكبر من تاريخ البداية

# ScheduleRequired
source: Schedule is not provided
ar_eg: الجدول الزمنى غير متوفر

# TransferScheduleInvalidDate
source: Transfer period is out of the schedule available period
ar_eg: فترة النقل خارج الفترة المتاحة فى الجدول الزمنى

# EndDateEmpty
source: End Date is not provided
ar_eg: لم يتم توفير وقت الانتهاء

# HolidayCodeEmpty
source: Code is not provided
ar_eg: الكود غير محدد

# HolidayCodeLength
source: Code should be within 1 and 50 letters
ar_eg: الكود يجب ان يكون مابين 1 الى 50 حرف

# HolidayCodeUnique
source: Code Should be Unique
ar_eg: الكود لا يمكن ان يتكرر

# DepartmentDescriptionLength
source: Description should not exceed 200 character
ar_eg: الوصف يجب الا يتعدي 200 حرف

# InvalidGenderId
source: Invalid Gender
ar_eg: الجنس غير صحيح

# InvalidTitleId
source: Invalid job title
ar_eg: المسمى الوظيفى غير صحيح

# ExcuseTypeEmpty
source: Excuse type not provided
ar_eg: نوع الاذن غير متوفر

# IsNative
source: [IsNative] value invalid
ar_eg: [IsNative] قيمه الحقل غير صحيحه

# ExcuseDurationEqualZero
source: No shifts for you in this time frame
ar_eg: لا يوجد وردية فى هذا الوقت لك

# DelegateIdEmpty
source: Person is not provided
ar_eg: المندوب غير متوفر

source: Invalid Day
ar_eg: اليوم غير صحيح

# ReportIdEmpty
source: Report is not provided
ar_eg: التقرير غير محدد

# InvalidSchedulePersonnel_HireDate
source: You can only assign a schedule to personnel after their joining date. Please select a start date > joining date
ar_eg: تاريخ بدايه الجدول الزمني يجب ان يكون اكبر من تاريخ الالتحاق بالعمل

# InvalidPersonReportPrivilage
source: selected person doesn't have that report privileges
ar_eg: هذا الموظف ليس لديه الصلاحيه لرؤيه هذا التقرير

# InvalidCCs
source: Invalid CCs Email Address Format
ar_eg: صيغة البريد الالكترونى غير صحيحة

# EmptyPersonAndEmail
source: Either person or email should be provided
ar_eg: اما الموظف او البريد الالكتروني يجب ان يكون محدد

# InvalidIncludeSupervisor
source: Department should be selected to be able to send to the supervisor
ar_eg: القسم يجب ان يكون محدد لتتمكن من الارسال الي المشرف

# InvalidTarget
source: Should be one target at least for the report
ar_eg: يجب ان يكون هناك مستهدف واحد علي الاقل للتقرير

# DepartmentIdEmpty
source: Department is not provided
ar_eg: القسم غير متوفر

# InValidDuration
source: Shift duration should be greater than 0 and less than 24 hour ( or less than 48 for night shifts )
ar_eg: مده الورديه يجب ان تكون اكبر من صفر و اقل من 24 ساعه ( او اقل من 48 ساعه في حاله الورديه الليليه )

# InValidNightFlexibleCombination
source: Night shift cannot be flexible
ar_eg: الورديه المرنه لا يمكن ان تكون ليليه

source: Invalid end time
ar_eg: وقت البدايه غير صحيح

source: Invalid start time
ar_eg: وقت النهايه غير صحيح

# InvalidEditAttendanceEvent
source: Cannot apply multiple pending manual attendance at the same time
ar_eg: لا يمكن قبول اكثر من تعديل يدوى للحضور و الانصراف فى نفس الوقت

# LeaveAttachmentRequired
source: Attachments required for this leave type for {0}
ar_eg: هذا النوع من الاجازات {0} تشترط المرفقات

# InvalidShiftPolicy
source: Shift Policy is not valid
ar_eg: سياسة الوردية غير صحيحة

# PolicyAssociationsWithShift
source: Policy is being associated with Shifts
ar_eg: هذه السياسة مرتبطة بورديات

# LeaveStartDateExceedsOldLeavesDaysLimit
source: Leave for {0} Start exceeds days limit for old leaves
ar_eg: تاريخ بداية الأجازة ل{0} يتعدى الحد المسموح للاجازات القديمة

# EmploymentTypeEmpty
source: Employment Type is not provided
ar_eg: نوع التوظيف غير متوفر

# JobTitleEmpty
source: Job Title is not provided
ar_eg: المسمى الوظيفى غير متوفر

# LeaveInvalidLeaveTypePolicy
source: {0} has no association to the requested leave type
ar_eg: {0} لا يوجد لديه نوع الإجازة المطلوبة

# ArabicNameLengthInvalid
source: Arabic Name length should not exceed {0}
ar_eg: الاسم العربى يجب ان لا يتعدى {0} حرف

# NameLengthInvalid
source: Name length should not exceed {0}
ar_eg: الاسم يجب ان لا يتعدي {0} حرف

# LeaveEffectiveDayNotVaild
source: Leave days should not exceed {0}
ar_eg: عدد أيام الأجازة يجب أن لا يتعدي {0}

# PlannedLeavesNotAllow
source: Planned leaves not allowed for this leave type.
ar_eg: الأجازات المخطط لها غير مسموح بها في هذا النوع من الأجازات

# PersonCodeEmailInvalid
source: Code and Email should not be the same
ar_eg: رقم الموظف و البريد الإلكتروني يجب أن يكونوا مختلفين

# PersonCodeUsernameInvalid
source: Code and username should not be the same
ar_eg: رقم الموظف و أسم المستخدم يجب أن يكونوا مختلفين

# PersonUsernameEmailInvalid
source: Username and Email should not be the same
ar_eg: أسم المستخدم و البريد الإلكتروني يجب أن يكونوا مختلفين
